OpenDTEF-v2012/tutorials/incompressible/pimpleFoam/LES/channel395DFSEM/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType LES;

LES
{
    turbulence      on;

    LESModel        kEqn;
    kEqnCoeffs
    {
        Ce              1.048;
        Ck              0.02654; // set to approximate a Cs of 0.065
    }

    printCoeffs     on;

    delta           vanDriest;
    vanDriestCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        Aplus           26;
        Cdelta          0.158;
    }
}


// ************************************************************************* //
